const patterns = {
  "たきり": [{
    answer: "別れたきり",
    alts: [
      "別けれなきり",
      "別れっきり",
      "別れてきり"
    ],
    patterns: [
      {
        sentence: "n1 と | ~ 、 | 一度も | e1 。",
        inserts: {
          n1: [ "かれ", "かれし", "かのじょ", "彼氏", "彼女", "恋人" ],
          e1: [
            "連絡してない",
            "会ってない",
            "電話してない",
            "メールしてない"
          ]
        }
      }
    ]
  }],
  "てたまらない": [{
    answer: "たまらない",
    alts: [
      "たまる",
      "たまった",
      "たまにだ"
    ],
    patterns: [
      {
        sentence: "n1 に | 会いたくて | ~ 。",
        inserts: {
          n1: [
            "あなた", "きみ", "彼氏", "彼女", "お母さん" , "お父さん", "姉", "兄"
          ]
        }
      }
    ]
  }],
  "まずにはいられない": [{
    // answer kan ha flere (n2 page 22)
    answer: "まずにはいられない",
    alts: [
      "まないことしよう",
      "まずに寝ちゃう",
      "まなくてもならない",
    ],
    patterns: [{
      sentence: "晴れの日は | 微笑 ~ 。"
    }]
  }]
}

export default patterns;