const patterns = {
  ありふれた: [{
    answer: "ありふれた",
    alts: [
      "おだやかな",
      "おとなしい",
      "なれなれしい",
    ],
    patterns: [{
      sentence: "n1 は | あっというまに | ~ | ものに | なった。",
      inserts: {
        n1: [
          "離婚",
          "不倫",
          "失業",
        ]
      }
    }]
  }],
  慰める: [{
    answer: "なぐさめる",
    alts: [
      "なげる",
      "なさける",
      "なかせる",
    ],
    patterns: [{
      sentence: "a1 | n1 を | ~ のは | a2 。",
      inserts: {
        a1: [ "悲しい", "失敗した", "迷ってる", ],
        n1: [ "友達", "友人", "親戚", ],
        a2: [ "大切だ", "良い", "偉い", ],
      }
    }]
  }],
  焦る: [{
    answer: "焦らない",
    alts: [
      "慰めない",
      "のりかえた",
      "煮ない",
      "あこがれた",
    ],
    patterns: [{
      sentence: "n1 は | ~ | ほうがいいよ！",
      inserts: {
        n1: [ "婚活", "転職", "就職活動", "大学を選ぶこと", ]
      }
    }]
  }],
  憧れる: [{
    answer: "あこがれてる",
    alts: [
      "なぐさめる",
      "にる",
      "ふざける",
    ],
    patterns: [{
      sentence: "a1 | n1 と | 結婚するのを | ~ | 人が | おおい。",
      inserts: {
        n1: [ "男", "女", ],
        a1: [ "素敵な", "綺麗な", "優しい", "可愛い", "お金持ちな", ],
      }
    }]
  }],
  目が離せいない: [{
    answer: "目がはなせない",
    alts: [
      "目がわるい",
      "目がきれい",
      "目がない",
      "目が回らない",
    ],
    patterns: [{
      sentence: "行きたいけど、 | n1 が | 泥酔 | だから | ~ だ",
      inserts: {
        n1: [ "友達", "兄", "姉", "妹", "弟", ]
      }
    }]
  }],
  ついていく: [{
    answer: "ついて行って",
    alts: [
      "つき行って",
      "つく行って",
      "ついた行って",
    ],
    patterns: [{
      sentence: "n1 も | N_trainStation:shinkansen に | 行きたい！ | ~ | もいい？",
      inserts: {
        n1: ["僕","私",]
      }
    }]
  }]
}

export default patterns;
