const patterns = {
  "ている": [{
    answer: "開いています",
    alts: [ 
      "開きます",
      "開いていました",
      "開きています"
    ],
    patterns: [{
      sentence: "すみません。 | まだ ~ か？"
    }]
  },
  {
    answer: "教えています",
    alts: [
      "教えます",
      "教えていました",
      "教えいます",
    ],
    patterns: [{
      sentence: "n1 から | n2 で | n3 を | ~ 。",
      inserts: {
        n1: [ "先月", "去年","今年の四月","去年の四月",],
        n2: [ "学校", "中学校", "小学校", "高校", "大学", ],
        n3: [ "数学", "科学", "英語", "日本語", "国語", "地理", ],
      }
    }]
  }
]
}

export default patterns;
