const patterns = {
  "かたわら": [{
    answer: "かたわら",
    alts: [
      "かっこう",
      "かたち",
      "からおけ",
      "かたらわ"
    ],
    patterns: [
      {
        sentence: "N_name は | n1 の ~ 、 | s2 してる。",
        inserts: {
          n1: [ "農業", "学生", "歌手", "医者" ],
          s2: [
            "ネットで | 営業",
            "コンサルティング",
            "中古販売"
          ]
        }
      }
    ],
  }],
  '限った': [
    {
      answer: '限った',
      alts: [
        '限る', '限って', '限りたい', '限らない', '限り', '限ろう'
      ],
      patterns: [
        {
          sentence: 'A1 お客様に | ~ | 期間限定奉仕です',
          inserts: {
            A1: [ '新しい', '新たな', '最近入った' ]
          }
        }
      ]
    }
  ],
  "いかんでは": [
    {
      answer: "いかんでは",
      alts: [
        "いかない",
        "について",
        "限り"
      ],
      patterns: [{
        sentence: "n1 は、 | n2 ~ | n3 されるかも | しれません。",
        inserts: {
          n1: [ "試合", "大会", "コンサート", "祭り" ],
          n2: [ "天気", "天候", "天気予報" ],
          n3: [ "延期", "キャンセル", "中止" ]
        }
      }]
    }
  ],
  "からの": [
    {
      answer: "からの",
      alts: [
        "からある",
        "からする",
        "からなる",
        "からと",
        "からばら"
      ],
      patterns: [{
        sentence: "n1 の n2 には、 | n3 人 ~ 人が | 参加したわ！",
        inserts: {
          n1: [ "昨日", "先週", "先月" ],
          n2: [ "コンサート", "デモ", "試合" ],
          n3: [ "五千", "万", "千", "二万" ]
        }
      }]
    }
  ],
  "が相まって": [
    {
      answer: "が相まって",
      alts: [
        "から相まって",
        "に相まって",
        "の相まって",
      ],
      patterns: [{
        sentence: "n1 と n2 ~ , | 理想的な | n3 e1 。",
        inserts: {
          n1: [ "可愛さ", "ルックス", "いい体", "エロさ", "綺麗さ" ],
          n2: [ "賢さ", "頭の良さ", "上品さ", "優しさ" ],
          n3: [ "女", "彼女", "恋人" ],
          e1: [ "ですね", "に他ならない", "でなくてなんだろう" ],
        }
      }]
    }
  ],
  "しようにも": [{
    answer: "行こうにも",
    alts: [
      "行くにも",
      "行くまいが",
      "行こうまいが",
      "行ってしまいも"
    ],
    patterns: [{
      sentence: "N_country に | ~ 、 | n1 で | 行けないんでしょう。",
      inserts: {
        n1: [
          "コロナの影響",
          "コロナのせい",
          "ウイルスの影響",
          "ウイルスのせい"
        ]
      }
    }]
  }]
}

export default patterns;
