const patterns = {
  "パソコン": [{
    answer: "パソコン",
    alts: [
      "リモコン",
      "エアコン",
      "クレジットカード",
      "ベッド",
      "ヘッドフォン",
      "ソファ",
      "スピーカ",
    ],
    patterns: [{
      sentence: "n1 に | メールを送らなきゃ。 | ~ e1",
      inserts: {
        n1: [
          "父",
          "母",
          "先生",
          "部長",
          "先輩",
          "ボス",
        ],
        e1: [ "使っていい？", "使わせて。", "貸してくれない？", "貸して。" ]
      }
    }]
  }],
  "リモコン": [{
    answer: "リモコン",
    alts: [
      "パソコン",
      "エアコン",
      "クレジットカード",
      "ベッド",
      "ヘッドフォン",
      "ソファ",
      "スピーカ",
    ],
    patterns: [{
      sentence: "この番組は a1 ね。 | ~ e1",
      inserts: {
        a1: [
          "面白くない",
          "めんどくさい",
          "うるさい",
          "ひどい",
          "楽しくない",
          "まあまあだ",
        ],
        e1: [ "くれ。", "取って。", "ちょうだい。", "はどこ？" ]
      }
    }]
  }],
  "エアコン": [{
    answer: "エアコン",
    alts: [
      "パソコン",
      "リモコン",
      "クレジットカード",
      "ベッド",
      "ヘッドフォン",
      "ソファ",
      "スピーカ",
    ],
    patterns: [{
      sentence: "a1 ！ | ~ を | 付けようよ！",
      inserts: {
        a1: [ "熱い", "寒い" ]
      }
    }]
  }],
}

export default patterns;
